Revit 2024 API
ColorWithTransparency.GetTransparency Method
 get transparency
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public uint GetTransparency()
Visual Basic
Public Function GetTransparency As UInteger
Visual C++
public:
unsigned int GetTransparency()
Return Value
 transparency
See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace